MCUdude/MiniCore/avr/svd/atmega168pb.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00800060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCSR</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDP</name>
              <description>Watchdog Timer Prescaler Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_2K</name>
                  <description>Oscillator Cycles 2K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_4K</name>
                  <description>Oscillator Cycles 4K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_8K</name>
                  <description>Oscillator Cycles 8K</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_16K</name>
                  <description>Oscillator Cycles 16K</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_32K</name>
                  <description>Oscillator Cycles 32K</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_64K</name>
                  <description>Oscillator Cycles 64K</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_128K</name>
                  <description>Oscillator Cycles 128K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_256K</name>
                  <description>Oscillator Cycles 256K</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timeout Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>